In [1]:
import pandas as pd

In [2]:
data = {
    'Name' : ['Raj','Amit','Shiv'],
    'Age' : [28, 32, 25],
    'Salary' : [50000, 60000, 55000]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

   Name  Age  Salary
0   Raj   28   50000
1  Amit   32   60000
2  Shiv   25   55000

In [5]:
names = df['Name']
subset = df[['Name' , 'Age']]

In [6]:
names

0     Raj
1    Amit
2    Shiv
Name: Name, dtype: object

In [7]:
subset

   Name  Age
0   Raj   28
1  Amit   32
2  Shiv   25

In [8]:
df = pd.read_csv(r"C:\Users\chana\Downloads\diabetes.csv")

In [9]:
df

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1
...,...,...,...,...,...,...,...,...,...
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [11]:
df.head(3)

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1

In [18]:
df.tail()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
763,10,101,76,48,180,32.9,0.171,63,0
764,2,122,70,27,0,36.8,0.340,27,0
765,5,121,72,23,112,26.2,0.245,30,0
766,1,126,60,0,0,30.1,0.349,47,1
767,1,93,70,31,0,30.4,0.315,23,0

In [13]:
df.shape

(768, 9)

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [15]:
df.describe()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [17]:
df.columns

Index(['Pregnancies', 'Glucose', 'BloodPressure', 'SkinThickness', 'Insulin',
       'BMI', 'DiabetesPedigreeFunction', 'Age', 'Outcome'],
      dtype='object')

In [20]:
import numpy as np

In [21]:
data = {'Name' : ['Raj','Rohit','Amar','Suraj','Ravi'],
        'Age' : [28, np.nan, 25, 22, 31]}

In [22]:
df = pd.DataFrame(data)

In [23]:
df

    Name   Age
0    Raj  28.0
1  Rohit   NaN
2   Amar  25.0
3  Suraj  22.0
4   Ravi  31.0

In [24]:
df.isna()

    Name    Age
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [25]:
df

    Name   Age
0    Raj  28.0
1  Rohit   NaN
2   Amar  25.0
3  Suraj  22.0
4   Ravi  31.0

In [28]:
df.isna()

    Name    Age
0  False  False
1  False   True
2  False  False
3  False  False
4  False  False

In [29]:
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace = True)

C:\Users\chana\AppData\Local\Temp\ipykernel_604\4294355552.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_age, inplace = True)

In [31]:
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace=True)
df

C:\Users\chana\AppData\Local\Temp\ipykernel_604\4011514775.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(mean_age, inplace=True)

    Name   Age
0    Raj  28.0
1  Rohit  26.5
2   Amar  25.0
3  Suraj  22.0
4   Ravi  31.0

In [32]:
data = {'Name' : ['Raj' , 'Raj','Amar','Suraj','Ravi'],
        'Age' : [28,28,25,22,31]
       }
df = pd.DataFrame(data)

In [33]:
df

    Name  Age
0    Raj   28
1    Raj   28
2   Amar   25
3  Suraj   22
4   Ravi   31

In [34]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [36]:
df.drop_duplicates()

    Name  Age
0    Raj   28
2   Amar   25
3  Suraj   22
4   Ravi   31

In [37]:
df['Age'] = df['Age'].astype(int)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int32
dtypes: int32(1), object(1)
memory usage: 192.0+ bytes

In [39]:
data = {'Name' : ['Raj' , 'Rohit', 'Amar', 'Suraj','Ravi'],
        'Age' : [28,23,25,22,31],
        'Salary' : [10000,20000,30000,40000,50000]}

In [40]:
df = pd.DataFrame(data)

In [43]:
filtered_data = df[df['Salary'] > 20000]

In [44]:
filtered_data

    Name  Age  Salary
2   Amar   25   30000
3  Suraj   22   40000
4   Ravi   31   50000

In [45]:
selected_columns = df[['Name','Salary']]

In [47]:
selected_columns

    Name  Salary
0    Raj   10000
1  Rohit   20000
2   Amar   30000
3  Suraj   40000
4   Ravi   50000

In [48]:
single_column = df.Name

In [49]:
single_column

0      Raj
1    Rohit
2     Amar
3    Suraj
4     Ravi
Name: Name, dtype: object

In [50]:
selected_rows = df.loc[[0,2,4]]
selected_rows

   Name  Age  Salary
0   Raj   28   10000
2  Amar   25   30000
4  Ravi   31   50000

In [51]:
selected_rows = df.iloc[1:4]

In [52]:
selected_rows

    Name  Age  Salary
1  Rohit   23   20000
2   Amar   25   30000
3  Suraj   22   40000

In [54]:
subset = df.loc[[0,2,4],['Name','Salary']]

In [55]:
subset

   Name  Salary
0   Raj   10000
2  Amar   30000
4  Ravi   50000

In [56]:
data = {'Name' : ['Raj' , 'Rohit', 'Amar', 'Suraj','Ravi'],
        'Age' : [28,23,25,22,31],
        'Salary' : [10000,20000,30000,40000,50000]}

df = pd.DataFrame(data)

In [60]:
grouped = df.groupby('Age').sum()

In [61]:
grouped

      Name  Salary
Age
22   Suraj   40000
23   Rohit   20000
25    Amar   30000
28     Raj   10000
31    Ravi   50000